In [2]:
import pandas as pd
import numpy as np

In [3]:
ser=pd.Series([0,1,2,np.nan,"Rahul",complex(3,4)])

In [4]:
print(ser)

0         0
1         1
2         2
3       NaN
4     Rahul
5    (3+4j)
dtype: object

In [5]:
data= {"Name":["Rahul","Satish","Satya","Sunil"],"Regd_No":[23240024,23240029,23240030,23240036]}
df=pd.DataFrame(data)
df

     Name   Regd_No
0   Rahul  23240024
1  Satish  23240029
2   Satya  23240030
3   Sunil  23240036

In [6]:
for index,row in df.iterrows():
    print(index,row)

0 Name          Rahul
Regd_No    23240024
Name: 0, dtype: object
1 Name         Satish
Regd_No    23240029
Name: 1, dtype: object
2 Name          Satya
Regd_No    23240030
Name: 2, dtype: object
3 Name          Sunil
Regd_No    23240036
Name: 3, dtype: object

In [7]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='Rahul', Regd_No=23240024)
Pandas(Index=1, Name='Satish', Regd_No=23240029)
Pandas(Index=2, Name='Satya', Regd_No=23240030)
Pandas(Index=3, Name='Sunil', Regd_No=23240036)

In [8]:
df.Regd_No.apply(np.sqrt)

0    4820.790806
1    4820.791325
2    4820.791429
3    4820.792051
Name: Regd_No, dtype: float64

In [12]:
#multiindexing
lst=pd.MultiIndex.from_frame(df)
lst

MultiIndex([( 'Rahul', 23240024),
            ('Satish', 23240029),
            ( 'Satya', 23240030),
            ( 'Sunil', 23240036)],
           names=['Name', 'Regd_No'])

In [13]:
lst[0][1]

23240024

In [15]:
df.reindex([2,3,0,1])

     Name   Regd_No
2   Satya  23240030
3   Sunil  23240036
0   Rahul  23240024
1  Satish  23240029

In [16]:
data2= {"Name":["Rahul","Satish","Satya","Sunil"],"Status":["Unplaced","Unplaced","Placed","Placed"]}
df2=pd.DataFrame(data2)
df2

     Name    Status
0   Rahul  Unplaced
1  Satish  Unplaced
2   Satya    Placed
3   Sunil    Placed

In [17]:
#merge
newdf=df.merge(df2, on="Name")
newdf

     Name   Regd_No    Status
0   Rahul  23240024  Unplaced
1  Satish  23240029  Unplaced
2   Satya  23240030    Placed
3   Sunil  23240036    Placed

In [20]:
#concat
newdf2=pd.concat([df,df2], axis=0)
newdf2

     Name     Regd_No    Status
0   Rahul  23240024.0       NaN
1  Satish  23240029.0       NaN
2   Satya  23240030.0       NaN
3   Sunil  23240036.0       NaN
0   Rahul         NaN  Unplaced
1  Satish         NaN  Unplaced
2   Satya         NaN    Placed
3   Sunil         NaN    Placed

In [23]:
#Categorical data
df3=pd.DataFrame({'Payment':['Cash','Card','Cash','UPI','Card']})
# Convert to categorical
df3['Payment']=df3['Payment'].astype('category')
print(df3['Payment'])

0    Cash
1    Card
2    Cash
3     UPI
4    Card
Name: Payment, dtype: category
Categories (3, object): ['Card', 'Cash', 'UPI']